In [6]:
# importing pandas for the notebook
import pandas as pd

#link for the tables
demoLink="https://en.wikipedia.org/wiki/List_of_countries_by_GDP_(nominal)_per_capita"

# fetching the tables
demodata=pd.read_html(demoLink,header=0,flavor="bs4",attrs={'class':"wikitable"})

In [7]:
demoVars=demodata[0].copy()

In [8]:
# first rows
demoVars.head()

,Country/Territory,Subregion,Region,IMF[4],IMF[4].1,United Nations[5],United Nations[5].1,World Bank[6],World Bank[6].1
0,Country/Territory,Subregion,Region,Estimate,Year,Estimate,Year,Estimate,Year
1,Liechtenstein *,Western Europe,Europe,NaN,NaN,180227,2020,175814,2019
2,Monaco *,Western Europe,Europe,NaN,NaN,173696,2020,190513,2019
3,Luxembourg *,Western Europe,Europe,131302,2021,117182,2020,115874,2020
4,Bermuda *,Northern America,Americas,NaN,NaN,123945,2020,107080,2020

In [9]:
#column positions to drop
whichToDrop=[1,2,3,4,6,7,8]

#dropping and updating the data frame
demoVars.drop(labels=demoVars.columns[whichToDrop],axis=1,inplace=True)

In [10]:
# first rows
demoVars.head()

   Country/Territory United Nations[5]
0  Country/Territory          Estimate
1    Liechtenstein *            180227
2           Monaco *            173696
3       Luxembourg *            117182
4          Bermuda *            123945

In [11]:
demoVars.columns=demoVars.columns.str.replace("United Nations\[5]","GDP(US$Million)",regex=True)

# current colum names
demoVars.columns

Index(['Country/Territory', 'GDP(US$Million)'], dtype='object')

In [12]:
demoVars.columns=demoVars.columns.str.replace("Country/Territory","CountryOrTerritory",regex=True)

# current colum names
demoVars.columns

Index(['CountryOrTerritory', 'GDP(US$Million)'], dtype='object')

In [13]:

demoVars.head()

  CountryOrTerritory GDP(US$Million)
0  Country/Territory        Estimate
1    Liechtenstein *          180227
2           Monaco *          173696
3       Luxembourg *          117182
4          Bermuda *          123945

In [14]:
demoVars.drop([0], axis=0, inplace = True)

In [15]:
demoVars=demoVars.reset_index(drop=True)

In [16]:

demoVars.head()

  CountryOrTerritory GDP(US$Million)
0    Liechtenstein *          180227
1           Monaco *          173696
2       Luxembourg *          117182
3          Bermuda *          123945
4          Ireland *           86251

In [17]:
demoVars.to_csv("GDP Data.csv",index=False)

In [18]:
demoVars['GDP(US$Million)'].value_counts()

1421      2
180227    1
4007      1
3306      1
3890      1
         ..
10767     1
11183     1
6924      1
10229     1
286       1
Name: GDP(US$Million), Length: 213, dtype: int64

In [19]:
demoVars

    CountryOrTerritory GDP(US$Million)
0      Liechtenstein *          180227
1             Monaco *          173696
2         Luxembourg *          117182
3            Bermuda *          123945
4            Ireland *           86251
..                 ...             ...
212       Madagascar *             470
213       Mozambique *             449
214          Somalia *             118
215          Burundi *             286
216      South Sudan *            1421

[217 rows x 2 columns]

In [21]:
demoVars.to_csv("GDPdata.csv",index=False)